app/views/user_events/_form.html.erb

SELECT "events".* FROM "events"
---
          <%= f.label :event_id, "Selecciona un evento", class:"my-3"%>
          <%= f.select :event_id, options_for_select(Event.all.map{|e| [e.name, e.id]}), {}, {class: "form-select"} %>