app/controllers/events_controller.rb

  def create
    @event = Event.new(event_params)

    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("name", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["date", nil], ["created_at", "2023-03-08 22:39:05.454942"], ["updated_at", "2023-03-08 22:39:05.454942"]]

  def update
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "updated_at" = ? WHERE "events"."id" = ?  [["updated_at", "2023-03-08 22:39:05.464950"], ["id", 3]]

  def destroy
    @event.destroy
---
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 3]]