app/controllers/type_states_controller.rb

SELECT "type_states".* FROM "type_states"
---
  def index
    @type_states = TypeState.all

INSERT INTO "type_states" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "MyString"], ["created_at", "2023-03-09 10:50:02.145896"], ["updated_at", "2023-03-09 10:50:02.145896"]]
---
  def create
    @type_state = TypeState.new(type_state_params)

    respond_to do |format|
      if @type_state.save

DELETE FROM "type_states" WHERE "type_states"."id" = ?  [["id", 980190962]]
---
  def destroy
    @type_state.destroy

SELECT "type_states".* FROM "type_states" WHERE "type_states"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]
---
    def set_type_state
      @type_state = TypeState.find(params[:id])