app/controllers/user_events_controller.rb

SELECT "user_events".* FROM "user_events"
---
  def index
    @user_events = UserEvent.all

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "juan@gmail.com"], ["LIMIT", 1]]
INSERT INTO "user_events" ("user_id", "event_id", "type_state_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["event_id", 1], ["type_state_id", 1], ["created_at", "2023-03-08 18:14:22.287927"], ["updated_at", "2023-03-08 18:14:22.287927"]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["email", "maria@gmail.com"], ["created_at", "2023-03-09 01:56:54.259404"], ["updated_at", "2023-03-09 01:56:54.259404"]]
INSERT INTO "user_events" ("user_id", "event_id", "type_state_id", "created_at", "updated_at", "state") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 5], ["event_id", 1], ["type_state_id", nil], ["created_at", "2023-03-09 11:44:25.506473"], ["updated_at", "2023-03-09 11:44:25.506473"], ["state", "No responde"]]
---
  def create
    @user = User.find_by_email(user_event_params[:email])
    puts @user
    if @user.nil?
      puts "no existe el usuario"
      @user = User.new(name: "", email: user_event_params[:email])
      @user.save
      puts "Se crea el nuevo usuario"
    end
    @user_event = UserEvent.new(user_id: @user.id, event_id: user_event_params[:event_id], type_state_id: 1)

    respond_to do |format|
      if @user_event.save

DELETE FROM "user_events" WHERE "user_events"."id" = ?  [["id", 2]]
---
  def destroy
    @user_event.destroy

SELECT "user_events".* FROM "user_events" WHERE "user_events"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "user_events" SET "type_state_id" = ?, "updated_at" = ? WHERE "user_events"."id" = ?  [["type_state_id", 2], ["updated_at", "2023-03-09 01:51:59.959650"], ["id", 1]]
---
  def change_state
    puts params
    puts "hola"
    @user_event = UserEvent.find_by_id(params[:id])
    @user_event.update(type_state_id: params[:new_state])

SELECT "user_events".* FROM "user_events" WHERE "user_events"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_user_event
      @user_event = UserEvent.find(params[:id])